 
                                  3/14 Put tablet
push Start=10       §1/14 tab. diss.§2
wait    min §3:§4放入洗涤片
P10=开始                        清洗
分钟   §1:§2                       清洗咖啡单元
6 X          §1              请稍候
                                 
                                  2/14 Cleaning
Active                清洗
启动                                
                                  11/14 Skip final
coffee YES=1       §1/14 Rep. clean
§2/2 YES=10 NO=ot  1/14 Man. brush
and push 10         4/14 Brewer is
closing              5/14 2nd diss.
cycle will start     §1/14 §2 Clean.
active §3           Brewer in
open position             14/14 Brew. Cle.
Done.    10=Exit   §1 Mixer §2
rinsing                 §1 Brewer
Rinsing                   Start procedure?
YES=10 NO=8        §1/14 §2 Clean.
wait please         12/14 Coffee
delivery               §1/§2 emptying
in progress          §1/§2 conn. desc.
solution   OK=10  §1/§2 fill. desc.
sol. in progress  §1/§2 water
flows?    YES=10        §1/§2  descaling
solution filling   §1/§2  solution
action=>min §3:§4   §1/§2 desc. sol.
draining §3/§4     §1/§2 result?
OK=10   NO=OTHER      §1/§2 connect
water      OK=10      §1/§2 filling
water in progr.       §1/§2 rinsing
with water            §1/§2 disp. and
test water  Y=10    §1/§2 catch
water to test           §1/§2 descaling
done. EXIT=10       §1/§2 open
boiler tap Y=10          §1/§2 close
boiler tap Y=10         auto rinsing
in progress            Periodic rinse
in §1 seconds        Proc.Type: 8=MAN
9=A.Skip AUTO=10    
                                  